#ifndef __DISPLAY_H__
#define __DISPLAY_H__

#define Nums 3
#define ROWS 800
#define COLS 480

#define COLOR_RED 0x00FF0000
#define COLOR_GREEN 0x0000FF00
#define COLOR_BLUE 0x000000FF
#define COLOR_WHITE 0x00FFFFFF
#define COLOR_BLACK 0
#define COLOR_ORANGE 0x00FFC125
#define COLOR_PURPLE 0x00D15FEE
#define COLOR_GRAY 0x00C1C1C1

#include <stdio.h>
#include <stdlib.h>
#include <sys/types.h>
#include <sys/stat.h>
#include <fcntl.h>
#include <unistd.h>
#include <sys/mman.h>


/************************************************
 * 功能：初始化LCD屏幕
 * 参数：无
 * 返回值：无
*************************************************/
int lcd_init();

/************************************************
 * 功能：关闭LCD屏幕
 * 参数：无
 * 返回值：无
*************************************************/
void lcd_close();

/************************************************
 * 功能：刷背景色
 * 参数：
 *      color：要显示的背景颜色
 * 返回值：无
*************************************************/
void lcd_brushBG(unsigned int color);

/************************************************
 * 功能：在指定的位置画矩形(实心)
 * 参数：
 *      x0,y0：矩形显示的位置(左上顶点)
 *      w,h：矩形的宽度和高度
 *      color：矩形的填充颜色
 * 返回值：无
*************************************************/
void lcdDrawRect(int x0,int y0,int w,int h,unsigned int color);

/************************************************
 * 功能：在指定的位置画圆形(实心)
 * 参数：
 *      x0,y0：圆心的坐标
 *      r：半径
 *      color：圆形的填充颜色
 * 返回值：无
*************************************************/
void lcdDrawCircle(int x0,int y0,int r,unsigned int color);

/************************************************
 * 功能：在指定的位置画像素点
 * 参数：
 *      x,y：像素点的坐标
 *      color：像素点的颜色值
 * 返回值：无
*************************************************/
void lcdDrawPoint(int x,int y,unsigned int color);

/************************************************
 * 功能：显示图片
 * 参数：
 *      *pic_path：要显示的图片的路径
 *           flag：选择直接显示图片或存储
 *          x0,y0：图片显示位置
 * 返回值：无
*************************************************/
void lcdDrawBMP(const char *pic_path, int flag, int x0,int y0);

/************************************************
 * 功能：将数组变为随机顺序数组
 * 参数：
 *      arr：要打乱顺序的数组
 *        n：要打乱的数组的长度
 * 返回值：无
*************************************************/
void randNums(int *arr, size_t n);

/************************************************
 * 功能：生成自增数组
 * 参数：
 *      arr：要生成的数组
 *        n：要生成的数组的长度
 * 返回值：无
*************************************************/
void creNums(int *arr, size_t n);

/************************************************
 * 功能：随机打印
 * 参数：
 *      arr：要打印的数组
 * 返回值：无
*************************************************/
void print_random_element(int array[ROWS][COLS],int x0,int y0);

/************************************************
 * 功能：选择打印特效
 * 参数：
 *      x0,y0：打印坐标
 *       flag：选择特效
 * 返回值：无
*************************************************/
void randDisplay(int x0,int y0,int flag);

/************************************************
 * 功能：无特效打印图片
 * 参数：
 *      x0,y0：打印坐标
 * 返回值：无
*************************************************/
void randDisplay0(int x0,int y0);

/************************************************
 * 功能：随机条纹打印图片
 * 参数：
 *      x0,y0：打印坐标
 * 返回值：无
*************************************************/
void randDisplay1(int x0,int y0);

/************************************************
 * 功能：随机像素打印图片
 * 参数：
 *      x0,y0：打印坐标
 * 返回值：无
*************************************************/
void randDisplay2(int x0,int y0);

#endif