#ifndef __DISPLAY_H__
#define __DISPLAY_H__

#define Nums 3
#define ROWS 800
#define COLS 480

#define COLOR_RED 0x00FF0000
#define COLOR_GREEN 0x0000FF00
#define COLOR_BLUE 0x000000FF
#define COLOR_WHITE 0x00FFFFFF
#define COLOR_BLACK 0
#define COLOR_ORANGE 0x00FFC125
#define COLOR_PURPLE 0x00D15FEE
#define COLOR_GRAY 0x00C1C1C1

#include <stdio.h>
#include <stdlib.h>
#include <sys/types.h>
#include <sys/stat.h>
#include <fcntl.h>
#include <unistd.h>
#include <sys/mman.h>

void lcdDrawPoint1(int x,int y,unsigned int color);

/************************************************
 * 功能：显示图片
 * 参数：
 *      *pic_path：要显示的图片的路径
 *           flag：选择直接显示图片或存储
 *          x0,y0：图片显示位置
 * 返回值：无
*************************************************/
void lcdDrawBMP1(const char *pic_path, int flag, int x0,int y0);

/************************************************
 * 功能：将数组变为随机顺序数组
 * 参数：
 *      arr：要打乱顺序的数组
 *        n：要打乱的数组的长度
 * 返回值：无
*************************************************/
void randNums(int *arr, size_t n);

/************************************************
 * 功能：生成自增数组
 * 参数：
 *      arr：要生成的数组
 *        n：要生成的数组的长度
 * 返回值：无
*************************************************/
void creNums(int *arr, size_t n);

/************************************************
 * 功能：随机打印
 * 参数：
 *      arr：要打印的数组
 * 返回值：无
*************************************************/
void print_random_element(int array[ROWS][COLS],int x0,int y0);

/************************************************
 * 功能：选择打印特效
 * 参数：
 *      x0,y0：打印坐标
 *       flag：选择特效
 * 返回值：无
*************************************************/
void randDisplay(int x0,int y0,int flag);

/************************************************
 * 功能：无特效打印图片
 * 参数：
 *      x0,y0：打印坐标
 * 返回值：无
*************************************************/
void randDisplay0(int x0,int y0);

/************************************************
 * 功能：随机条纹打印图片
 * 参数：
 *      x0,y0：打印坐标
 * 返回值：无
*************************************************/
void randDisplay1(int x0,int y0);

/************************************************
 * 功能：随机像素打印图片
 * 参数：
 *      x0,y0：打印坐标
 * 返回值：无
*************************************************/
void randDisplay2(int x0,int y0);

/************************************************
 * 功能：棋盘打印图片
 * 参数：
 *      x0,y0：打印坐标
 * 返回值：无
*************************************************/
void randDisplay3(int x0,int y0);

/************************************************
 * 功能：幕布打印图片
 * 参数：
 *      x0,y0：打印坐标
 * 返回值：无
*************************************************/
void randDisplay4(int x0,int y0);

/************************************************
 * 功能：四格旋转打印图片
 * 参数：
 *      x0,y0：打印坐标
 * 返回值：无
*************************************************/
void randDisplay5(int x0,int y0);

/************************************************
 * 功能：将图片数据存储在二维数组中
 * 参数：
 *      *p：读取的像素数组指针
 * 返回值：无
*************************************************/
void readInformation(unsigned char *p);

#endif